In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01  1.332641 -0.030343 -1.423667 -1.489584
2013-01-02  0.254805  1.432587  0.029786 -1.221798
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251
2013-01-04  0.122012  0.214166 -0.152885  0.106820
2013-01-05  1.979828  0.026832 -0.251677 -0.732739
2013-01-06  0.599178  1.396837 -1.358414  0.186841

In [9]:
df2 = pd.DataFrame({ 'A' : 1.,
                     'B' : pd.Timestamp('20130102'),
                     'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                     'D' : np.array([3] * 4,dtype='int32'),
                     'E' : pd.Categorical(["test","train","test","train"]),
                     'F' : 'foo' })

In [10]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head()

                   A         B         C         D
2013-01-01  1.332641 -0.030343 -1.423667 -1.489584
2013-01-02  0.254805  1.432587  0.029786 -1.221798
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251
2013-01-04  0.122012  0.214166 -0.152885  0.106820
2013-01-05  1.979828  0.026832 -0.251677 -0.732739

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [15]:
df.values

array([[ 1.33264073, -0.03034331, -1.42366732, -1.48958391],
       [ 0.25480534,  1.43258653,  0.02978578, -1.22179784],
       [ 0.72843747, -0.61478351, -0.42680602, -0.53625121],
       [ 0.12201223,  0.21416567, -0.15288492,  0.10682039],
       [ 1.97982835,  0.02683165, -0.25167746, -0.73273947],
       [ 0.59917803,  1.39683673, -1.35841382,  0.18684114]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.836150  0.404216 -0.597277 -0.614452
std    0.702882  0.830492  0.632683  0.680755
min    0.122012 -0.614784 -1.423667 -1.489584
25%    0.340899 -0.016050 -1.125512 -1.099533
50%    0.663808  0.120499 -0.339242 -0.634495
75%    1.181590  1.101169 -0.177583 -0.053948
max    1.979828  1.432587  0.029786  0.186841

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.332641    0.254805    0.728437    0.122012    1.979828    0.599178
B   -0.030343    1.432587   -0.614784    0.214166    0.026832    1.396837
C   -1.423667    0.029786   -0.426806   -0.152885   -0.251677   -1.358414
D   -1.489584   -1.221798   -0.536251    0.106820   -0.732739    0.186841

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.489584 -1.423667 -0.030343  1.332641
2013-01-02 -1.221798  0.029786  1.432587  0.254805
2013-01-03 -0.536251 -0.426806 -0.614784  0.728437
2013-01-04  0.106820 -0.152885  0.214166  0.122012
2013-01-05 -0.732739 -0.251677  0.026832  1.979828
2013-01-06  0.186841 -1.358414  1.396837  0.599178

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251
2013-01-01  1.332641 -0.030343 -1.423667 -1.489584
2013-01-05  1.979828  0.026832 -0.251677 -0.732739
2013-01-04  0.122012  0.214166 -0.152885  0.106820
2013-01-06  0.599178  1.396837 -1.358414  0.186841
2013-01-02  0.254805  1.432587  0.029786 -1.221798

In [20]:
df['A'] #select a single column

2013-01-01    1.332641
2013-01-02    0.254805
2013-01-03    0.728437
2013-01-04    0.122012
2013-01-05    1.979828
2013-01-06    0.599178
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3] #slices along the rows

                   A         B         C         D
2013-01-01  1.332641 -0.030343 -1.423667 -1.489584
2013-01-02  0.254805  1.432587  0.029786 -1.221798
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251

In [22]:
df['20130102':'20130104'] #slices among rows again

                   A         B         C         D
2013-01-02  0.254805  1.432587  0.029786 -1.221798
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251
2013-01-04  0.122012  0.214166 -0.152885  0.106820

In [23]:
df.loc[dates[0]] #selection by label

A    1.332641
B   -0.030343
C   -1.423667
D   -1.489584
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:,['A','B']] #electing on a multi-axis by label

                   A         B
2013-01-01  1.332641 -0.030343
2013-01-02  0.254805  1.432587
2013-01-03  0.728437 -0.614784
2013-01-04  0.122012  0.214166
2013-01-05  1.979828  0.026832
2013-01-06  0.599178  1.396837

In [25]:
df.loc['20130102':'20130104',['A','B']] #Showing label slicing, both endpoints are included

                   A         B
2013-01-02  0.254805  1.432587
2013-01-03  0.728437 -0.614784
2013-01-04  0.122012  0.214166

In [26]:
df.loc['20130102',['A','B']] #Reduction in the dimensions of the returned object

A    0.254805
B    1.432587
Name: 2013-01-02 00:00:00, dtype: float64

In [27]:
df.loc[dates[0],'A'] #for getting a scalar value

1.3326407276020582

In [28]:
df.at[dates[0],'A'] #For getting fast access to a scalar (equiv to the prior method)

1.3326407276020582

In [29]:
#selection by position
df.iloc[3] #Select via the position of the passed integers

A    0.122012
B    0.214166
C   -0.152885
D    0.106820
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[3:5,0:2] #By integer slices, acting similar to numpy/python

                   A         B
2013-01-04  0.122012  0.214166
2013-01-05  1.979828  0.026832

In [31]:
df.iloc[[1,2,4],[0,2]] #By lists of integer position locations, similar to the numpy/python style

                   A         C
2013-01-02  0.254805  0.029786
2013-01-03  0.728437 -0.426806
2013-01-05  1.979828 -0.251677

In [32]:
df.iloc[1:3,:] #For slicing rows explicitly

                   A         B         C         D
2013-01-02  0.254805  1.432587  0.029786 -1.221798
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251

In [33]:
df.iloc[:,1:3] #For slicing columns explicitly

                   B         C
2013-01-01 -0.030343 -1.423667
2013-01-02  1.432587  0.029786
2013-01-03 -0.614784 -0.426806
2013-01-04  0.214166 -0.152885
2013-01-05  0.026832 -0.251677
2013-01-06  1.396837 -1.358414

In [34]:
df.iloc[1,1] #for getting a value explicitly

1.4325865321896962

In [35]:
df.iat[1,1] #For getting fast access to a scalar (equiv to the prior method)

1.4325865321896962

In [36]:
#boolean indexing
df[df.A > 0] #Using a single column’s values to select data.

                   A         B         C         D
2013-01-01  1.332641 -0.030343 -1.423667 -1.489584
2013-01-02  0.254805  1.432587  0.029786 -1.221798
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251
2013-01-04  0.122012  0.214166 -0.152885  0.106820
2013-01-05  1.979828  0.026832 -0.251677 -0.732739
2013-01-06  0.599178  1.396837 -1.358414  0.186841

In [37]:
df[df > 0] #a where operation for getting

                   A         B         C         D
2013-01-01  1.332641       NaN       NaN       NaN
2013-01-02  0.254805  1.432587  0.029786       NaN
2013-01-03  0.728437       NaN       NaN       NaN
2013-01-04  0.122012  0.214166       NaN  0.106820
2013-01-05  1.979828  0.026832       NaN       NaN
2013-01-06  0.599178  1.396837       NaN  0.186841

In [38]:
#Using the isin() method for filtering:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  1.332641 -0.030343 -1.423667 -1.489584    one
2013-01-02  0.254805  1.432587  0.029786 -1.221798    one
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251    two
2013-01-04  0.122012  0.214166 -0.152885  0.106820  three
2013-01-05  1.979828  0.026832 -0.251677 -0.732739   four
2013-01-06  0.599178  1.396837 -1.358414  0.186841  three

In [39]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251   two
2013-01-05  1.979828  0.026832 -0.251677 -0.732739  four

In [40]:
#Setting a new column automatically aligns the data by the indexes
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [41]:
df['F'] = s1
df

                   A         B         C         D   F
2013-01-01  1.332641 -0.030343 -1.423667 -1.489584 NaN
2013-01-02  0.254805  1.432587  0.029786 -1.221798   1
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251   2
2013-01-04  0.122012  0.214166 -0.152885  0.106820   3
2013-01-05  1.979828  0.026832 -0.251677 -0.732739   4
2013-01-06  0.599178  1.396837 -1.358414  0.186841   5

In [42]:
#Setting values by label
df.at[dates[0],'A'] = 0
df

                   A         B         C         D   F
2013-01-01  0.000000 -0.030343 -1.423667 -1.489584 NaN
2013-01-02  0.254805  1.432587  0.029786 -1.221798   1
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251   2
2013-01-04  0.122012  0.214166 -0.152885  0.106820   3
2013-01-05  1.979828  0.026832 -0.251677 -0.732739   4
2013-01-06  0.599178  1.396837 -1.358414  0.186841   5

In [43]:
#Setting values by position
df.iat[0,1] = 0
df

                   A         B         C         D   F
2013-01-01  0.000000  0.000000 -1.423667 -1.489584 NaN
2013-01-02  0.254805  1.432587  0.029786 -1.221798   1
2013-01-03  0.728437 -0.614784 -0.426806 -0.536251   2
2013-01-04  0.122012  0.214166 -0.152885  0.106820   3
2013-01-05  1.979828  0.026832 -0.251677 -0.732739   4
2013-01-06  0.599178  1.396837 -1.358414  0.186841   5

In [44]:
#Setting by assigning with a numpy array
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -1.423667  5 NaN
2013-01-02  0.254805  1.432587  0.029786  5   1
2013-01-03  0.728437 -0.614784 -0.426806  5   2
2013-01-04  0.122012  0.214166 -0.152885  5   3
2013-01-05  1.979828  0.026832 -0.251677  5   4
2013-01-06  0.599178  1.396837 -1.358414  5   5

In [45]:
#A where operation with setting.
df2 = df.copy()
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -1.423667  5 NaN
2013-01-02  0.254805  1.432587  0.029786  5   1
2013-01-03  0.728437 -0.614784 -0.426806  5   2
2013-01-04  0.122012  0.214166 -0.152885  5   3
2013-01-05  1.979828  0.026832 -0.251677  5   4
2013-01-06  0.599178  1.396837 -1.358414  5   5

df2[df2 > 0] = -df2
df2

In [46]:
#missing data
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000 -1.423667  5 NaN   1
2013-01-02  0.254805  1.432587  0.029786  5   1   1
2013-01-03  0.728437 -0.614784 -0.426806  5   2 NaN
2013-01-04  0.122012  0.214166 -0.152885  5   3 NaN

In [47]:
#To drop any rows that have missing data.
df1.dropna(how='any') #all that's left is this one row

                   A         B         C  D  F  E
2013-01-02  0.254805  1.432587  0.029786  5  1  1

In [48]:
#Filling missing data
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000 -1.423667  5  5  1
2013-01-02  0.254805  1.432587  0.029786  5  1  1
2013-01-03  0.728437 -0.614784 -0.426806  5  2  5
2013-01-04  0.122012  0.214166 -0.152885  5  3  5

In [49]:
#To get the boolean mask where values are nan
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [50]:
#operations

In [51]:
#stats
df.mean() #Operations in general exclude missing data.

A    0.614044
B    0.409273
C   -0.597277
D    5.000000
F    3.000000
dtype: float64

In [52]:
#Same operation on the other axis
df.mean(1)

2013-01-01    0.894083
2013-01-02    1.543436
2013-01-03    1.337370
2013-01-04    1.636659
2013-01-05    2.150997
2013-01-06    2.127520
Freq: D, dtype: float64

In [54]:
#Operating with objects that have different dimensionality and need alignment.
#In addition, pandas automatically broadcasts along the specified dimension.
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [55]:
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03 -0.271563 -1.614784 -1.426806   4   1
2013-01-04 -2.877988 -2.785834 -3.152885   2   0
2013-01-05 -3.020172 -4.973168 -5.251677   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

In [ ]:
#apply functions to data